ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_spi.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_FLAG(SPI_Flag));

  statusreg = SPIx->SR;

  if ((statusreg & SPI_Flag) != (u32)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*********************************************************************************************************//**
 * @brief Return the status of specified SPI FIFO.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_FIFODirection: specify the FIFO that is to be checked.
 *   This parameter can be one of the following values:
 *     @arg SPI_FIFO_TX :
 *     @arg SPI_FIFO_RX :
 * @retval The number of data in Tx FIFO or Rx FIFO.
 ************************************************************************************************************/
u8 SPI_GetFIFOStatus(HT_SPI_TypeDef* SPIx, u32 SPI_FIFODirection)
{
  u32 tmpreg;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_FIFO_DIRECTION(SPI_FIFODirection));

  if (SPI_FIFODirection == SPI_FIFO_TX)
  {
    tmpreg = SPIx->FSR & FCR_FIFO_MASK;
  }
  else
  {
    tmpreg = (SPIx->FSR & (FCR_FIFO_MASK << 4)) >> 4;
  }

  return (u8)tmpreg;
}

/*********************************************************************************************************//**
 * @brief Clear the specified SPI flag.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_Flag: specify the flag that is to be cleared.
 *   This parameter can be one of the following values:
 *     @arg SPI_FLAG_WC   : SPI write collision flag
 *     @arg SPI_FLAG_RO   : SPI read overrun flag
 *     @arg SPI_FLAG_MF   : SPI mode fault flag
 *     @arg SPI_FLAG_SA   : SPI slave abort flag
 *     @arg SPI_FLAG_TOUT : SPI time out flag
 * @retval None
 ************************************************************************************************************/
void SPI_ClearFlag(HT_SPI_TypeDef* SPIx, u32 SPI_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_FLAG_CLEAR(SPI_Flag));

  SPIx->SR = SPI_Flag;
}

/*********************************************************************************************************//**
 * @brief Set the trigger level of SPI FIFO.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_FIFODirection: specify the FIFO that is to be set.
 *   This parameter can be one of the following values:
 *     @arg SPI_FIFO_TX :
 *     @arg SPI_FIFO_RX :
 * @param SPI_FIFOLevel: Specify the FIFO trigger level.
 * @retval None
 ************************************************************************************************************/
void SPI_FIFOTriggerLevelConfig(HT_SPI_TypeDef* SPIx, u32 SPI_FIFODirection, u8 SPI_FIFOLevel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_FIFO_DIRECTION(SPI_FIFODirection));
  Assert_Param(IS_SPI_FIFO_LEVEL(SPI_FIFOLevel));

  if (SPI_FIFODirection == SPI_FIFO_TX)
  {
    SPIx->FCR = ((SPIx->FCR & (0x00000400 | (FCR_FIFO_MASK << 4))) | SPI_FIFOLevel);
  }
  else
  {
    SPIx->FCR = ((SPIx->FCR & (0x00000400 | FCR_FIFO_MASK)) | (SPI_FIFOLevel << 4));
  }
}

#if (LIBCFG_PDMA)
/*********************************************************************************************************//**
 * @brief Enable or Disable the SPIx PDMA interface.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_PDMAREQ: specify the SPI PDMA transfer request to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg SPI_PDMAREQ_TX : Tx PDMA transfer request
 *     @arg SPI_PDMAREQ_RX : Rx PDMA transfer request
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_PDMACmd(HT_SPI_TypeDef* SPIx, u32 SPI_PDMAREQ, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_PDMA_REQ(SPI_PDMAREQ));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    SPIx->CR0 |= SPI_PDMAREQ;
  }
  else
  {
    SPIx->CR0 &= ~SPI_PDMAREQ;
  }
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable the SPIx dual port read interface.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_DUALCmd(HT_SPI_TypeDef* SPIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  while (SPIx->SR & SPI_FLAG_BUSY);      /* Wait until SPI NOT BUSY                                         */

  (NewState == ENABLE)?(SPIx->CR0 |= CR0_DUALEN_SET):(SPIx->CR0 &= CR0_DUALEN_RESET);
}

#if (LIBCFG_QSPI)
/*********************************************************************************************************//**
 * @brief Enable or Disable the QSPI quad port interface.
 * @param SPIx: where SPIx is the selected QSPI from the QSPI peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void QSPI_QuadCmd(HT_SPI_TypeDef* SPIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_QSPI(SPIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  while (SPIx->SR & SPI_FLAG_BUSY);      /* Wait until SPI NOT BUSY                                         */

  if (NewState == DISABLE)
  {
    QSPI_DirectionConfig(SPIx, SIO_DIR_IN);
    SPIx->CR0 &= CR0_QUADEN_RESET;
  }
  else
  {
    SPIx->CR0 |= CR0_QUADEN_SET;
  }
}

